#Область ОбработчикиСобытий
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

	Если ТребуемыеПараметры = Неопределено Тогда

	Иначе

		УстановленныеПараметры = Новый Массив;
		Для Каждого ИмяПараметра Из ТребуемыеПараметры Цикл

			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры)
	Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ИмяПараметра = "ТекущийПользователь" Тогда

		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		Если ПользовательИБ = Неопределено Тогда
			Возврат;

		КонецЕсли;

		ТекущийПользователь = Справочники.Пользователи.НайтиПоКоду(ПользовательИБ.УникальныйИдентификатор);

		Если ТекущийПользователь.Пустая() Тогда
			ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
			ПользовательОбъект.Код = ПользовательИБ.УникальныйИдентификатор;
			ПользовательОбъект.Наименование = ПользовательИБ.Имя;
			ПользовательОбъект.Записать();
			ТекущийПользователь = ПользовательОбъект.Ссылка;
		КонецЕсли;
		ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;

	КонецЕсли;

	УстановленныеПараметры.Добавить(ИмяПараметра);
КонецПроцедуры
#КонецОбласти