#Область СлужебныеПроцедурыИФункции

// Проверить оказание услуг.
// 
// Параметры:
//  ЗаписьКлиента - ДокументСсылка.ЗаписьКлиента
// 
// Возвращаемое значение:
//  Булево - Проверить оказание услуг
Функция ПроверитьОказаниеУслуг(ЗаписьКлиента) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ЗаписьКлиента);
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровИУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Проведен
	|	И РеализацияТоваровИУслуг.Основание = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслуг.Ссылка";    
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
#КонецОбласти
