
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	
	СтруктураУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
	Если СтруктураУчетнаяПолитика.УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.FEFO Тогда
		ОтражатьСрокиГодности = Истина;
	Иначе 
		ОтражатьСрокиГодности = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИМатериаловНоменклатура.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровИМатериаловНоменклатура.СрокГодности КАК СрокГодности,
	|	СУММА(ПоступлениеТоваровИМатериаловНоменклатура.Количество) КАК Количество,
	|	ПоступлениеТоваровИМатериаловНоменклатура.Цена КАК Цена,
	|	СУММА(ПоступлениеТоваровИМатериаловНоменклатура.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ПоступлениеТоваровИМатериалов.Номенклатура КАК ПоступлениеТоваровИМатериаловНоменклатура
	|ГДЕ
	|	ПоступлениеТоваровИМатериаловНоменклатура.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровИМатериаловНоменклатура.Номенклатура,
	|	ПоступлениеТоваровИМатериаловНоменклатура.Цена,
	|	ПоступлениеТоваровИМатериаловНоменклатура.СрокГодности";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
		Если ОтражатьСрокиГодности Тогда 
            Движение.СрокГодности = Выборка.СрокГодности;
        КонецЕсли;

	КонецЦикла;
	
	
	
	
	
	
	
	
	
	//Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
	//	Движение = Движения.ТоварыНаСкладах.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Номенклатура = ТекСтрокаНоменклатура.Номенклатура;
	//	Движение.Склад = Склад;
	//	Движение.Количество = ТекСтрокаНоменклатура.Количество;
	//КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Номенклатура.Итог("Сумма"); 
	Если Ответственный.Пустая() Тогда 
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры
