
&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	УстановитьВидимостьДляУслуги();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДляУслуги();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Объект.Ссылка.Пустая() Тогда		ТекущаяРозничнаяЦена = РаботаСЦенамиВызовСервера.ПолучитьЦенуПродажиНаДату(Объект.Ссылка);	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦену(Команда)
	Если Объект.Ссылка.Пустая() Тогда		Сообщить("Перед установкой цены необходимо записать документ!");	Иначе		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаСозданияЦены",
			Новый Структура("Номенклатура", Объект.Ссылка),,,,, 
			Новый ОписаниеОповещения("ПослеИзмененияЦены", ЭтаФорма),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 	КонецЕсли;
КонецПроцедуры   

&НаКлиентеПроцедура ПослеИзмененияЦены(Результат, ДополнительныеПараметры) Экспорт    	ТекущаяРозничнаяЦена =  РаботаСЦенамиВызовСервера.ПолучитьЦенуПродажиНаДату(Объект.Ссылка);КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимостьДляУслуги()     
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда  
		Элементы.СрокГодности.Видимость = Ложь; 
		Элементы.ДлительностьУслуги.Видимость = Истина;
	Иначе
		Элементы.СрокГодности.Видимость = Истина;
		Элементы.ДлительностьУслуги.Видимость = Ложь;
	КонецЕсли
КонецПроцедуры 

