
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ответственный.Пустая() Тогда 
		Объект.Ответственный  = УзнатьТекущегоПользователяКлиент.УзнатьТекущегоПользователя();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		СтрокаТЧ.Стоимость = РаботаСЦенамиВызовСервера.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга, , Объект.Дата);
	Иначе
		СтрокаТЧ.Стоимость = 0;   
	КонецЕсли;     
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Для Каждого СтрокаТЧ  Из Объект.Услуги Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
			СтрокаТЧ.Стоимость = РаботаСЦенамиВызовСервера.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга, , Объект.Дата);
		Иначе
			СтрокаТЧ.Стоимость = 0;   
		КонецЕсли;     
	КонецЦИкла
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда 
		Если Параметры.Свойство("Начало") Тогда
			Объект.ДатаЗаписи = Параметры.Начало;
		КонецЕсли; 
		
		Если Параметры.Свойство("Окончание") Тогда
			Объект.ДатаОкончанияЗаписи = Параметры.Окончание;
		КонецЕсли;
		
		Если Параметры.Свойство("Сотрудник") Тогда
			Объект.Сотрудник = Параметры.Сотрудник;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Объект.ДатаЗаписи) Тогда
			Объект.Дата = НачалоДня(Объект.ДатаЗаписи);	
		КонецЕсли;  
		
		УстановитьДоступностьЭлемнтовФормы();
	КонецЕсли;
	
	
	УстановитьДоступностьЭлемнтовФормы();
КонецПроцедуры  

&НаСервере
Процедура УстановитьДоступностьЭлемнтовФормы()
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.УслугаОказана.ТолькоПросмотр = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Записан заказ");
КонецПроцедуры




