#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ответственный.Пустая() Тогда
		Объект.Ответственный  = УзнатьТекущегоПользователяКлиентПовтИсп.УзнатьТекущегоПользователя();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	Если Объект.СкладОтправитель = Объект.СкладПолучатель Тогда
		ВыводПредупрежденияПоСкладам();
		Объект.СкладОтправитель = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	Если Объект.СкладОтправитель = Объект.СкладПолучатель Тогда
		ВыводПредупрежденияПоСкладам();
		Объект.СкладПолучатель = Неопределено;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВыводПредупрежденияПоСкладам()
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Склад Отправитель не может быть Получателем!!!";
	Сообщение.Сообщить();

КонецПроцедуры
#КонецОбласти