
&НаСервере
Процедура ЗаписатьНаСервере()
	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);	НаборЗаписей.Отбор.ВидЦены.Установить(ВидЦены);	НаборЗаписей.Отбор.Период.Установить(ДатаНачалаДействияЦены);		НаборЗаписей.Прочитать();	Если НаборЗаписей.Количество() Тогда		НаборЗаписей[0].Цена = Цена;	Иначе		НоваяЗаписьЦен = НаборЗаписей.Добавить();		НоваяЗаписьЦен.Номенклатура = Номенклатура;		НоваяЗаписьЦен.ВидЦены = ВидЦены;		НоваяЗаписьЦен.Период = ДатаНачалаДействияЦены;		НоваяЗаписьЦен.Цена = Цена;	КонецЕсли;	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЦенаНаДату = РаботаСЦенамиВызовСервера.ПолучитьЗаписьЦеныНаКонкретнуюДату(Номенклатура, ВидЦены, ДатаНачалаДействияЦены); 	Если ЗначениеЗаполнено(ЦенаНаДату) Тогда       		ТекстВопроса = СтрШаблон("На указанную дату уже имеется введенная цена %1, вы действительно хотите изменить цену?", ЦенаНаДату);		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииЦены", ЭтаФорма);        		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");  	Иначе		ЗаписатьНаСервере(); 		Закрыть();			КонецЕсли;
КонецПроцедуры   

&НаКлиентеПроцедура ПослеОтветаНаВопросОбИзмененииЦены(Результат, ДополнительныеПараметры) Экспорт		Если Результат = КодВозвратаДиалога.Да Тогда		ЗаписатьНаСервере();		Закрыть();	КонецЕсли;	КонецПроцедуры 


&НаСервереПроцедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	ДатаНачалаДействияЦены = НачалоДня(ТекущаяДата());	Номенклатура = Параметры.Номенклатура;КонецПроцедуры 