#Область СлужебныеПроцедурыИФункции
Процедура ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти) Экспорт
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
КонецПроцедуры
Процедура ПересчитатьЦенуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти) Экспорт
	Если СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	Иначе
		СтрокаТабличнойЧасти.Цена = ОКР(СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество, 2);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти