#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.Договор.Видимость = Ложь;
		Элементы.ДатаРождения.Видимость = Истина;
		Элементы.ИсточникИнформации.Видимость = Истина;
		Элементы.Пол.Видимость = Истина;
		Элементы.Питомцы.Видимость = Истина;

		Если Не Объект.Договор.Пустая() Тогда
			Объект.Договор = Неопределено;
		КонецЕсли;

		Элементы.Наименование.Заголовок = "Ф.И.О. клиента";
	Иначе
		Элементы.ДатаРождения.Видимость = Ложь;
		Элементы.ИсточникИнформации.Видимость = Ложь;
		Элементы.Пол.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Ложь;
		Элементы.Договор.Видимость = Истина;

		Если ЗначениеЗаполнено(Объект.ДатаРождения) Тогда
			Объект.ДатаРождения = '0001,01,01';
		КонецЕсли;
		Если Не Объект.ИсточникИнформации.Пустая() Тогда
			Объект.ИсточникИнформации = Неопределено;
		КонецЕсли;
		Если Не Объект.Пол.Пустая() Тогда
			Объект.Пол = Неопределено;
		КонецЕсли;
		Если Не Объект.Питомцы.Количество() <> 0 Тогда
			Объект.Питомцы.Очистить();
		КонецЕсли;

		Элементы.Наименование.Заголовок = "Наименование";

	КонецЕсли;

КонецПроцедуры
#КонецОбласти