
&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	УстановитьВидимостьТипОрганизации()
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	УстановитьВидимостьТипОрганизации();
КонецПроцедуры     



&НаКлиенте
Процедура УстановитьВидимостьТипОрганизации()
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	Иначе
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
		Если Не Объект.ГлавныйБухгалтер.Пустая() Тогда 
			Объект.ГлавныйБухгалтер = Неопределено;
		КонецЕсли
		
	КонецЕсли
КонецПроцедуры

